app/Controllers/AdminMateri.php

SELECT *
FROM `materi`
---
    public function index()
    {
        $data['materi'] = $this->materiModel->findAll(); // Ambil semua data materi

SELECT *
FROM `materi`
WHERE `materi`.`materi_id` = '40'
---
    public function editMateri($id)
    {
        $materi = $this->materiModel->find($id);