app/Controllers/Admin.php

    public function dashboard()
    {
        // Cek apakah user sudah login dan memiliki role admin
        if (session()->get('role') != 'admin') {
            return redirect()->to('/auth/login');
        }

        // Ambil jumlah pengguna untuk ditampilkan di dashboard
        $jumlahPengguna = $this->userModel->countAll();
        $jumlahSeminar = $this->seminarModel->countAll();
        $jumlahMateri = $this->materiModel->countAll();
        $jumlahKuis = $this->kuisModel->countAll();

        // Modify to get only 3 most recent items
        $materi = $this->materiModel->orderBy('created_at', 'DESC')->findAll(3);
        $kuis = $this->kuisModel->orderBy('created_at', 'DESC')->findAll(3);
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `seminars`
SELECT COUNT(*) AS `numrows` FROM `materi`
SELECT COUNT(*) AS `numrows` FROM `kuis`
SELECT *
FROM `materi`
ORDER BY `created_at` DESC
 LIMIT 3
SELECT *
FROM `kuis`
ORDER BY `created_at` DESC
 LIMIT 3

    public function dashboardSeminar()
    {
        // Mendapatkan data seminar dari model
        $seminarModel = new SeminarModel();
        $seminars = $seminarModel->findAll();

        $jumlahPengguna = $this->userModel->countAll();
        $jumlahSeminar = $this->seminarModel->countAll();
        $jumlahMateri = $this->materiModel->countAll();
        $jumlahKuis = $this->kuisModel->countAll();

        // Get only 3 most recent seminars
        $seminars = $this->seminarModel->orderBy('created_at', 'DESC')->findAll(3);
---
SELECT *
FROM `seminars`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `seminars`
SELECT COUNT(*) AS `numrows` FROM `materi`
SELECT COUNT(*) AS `numrows` FROM `kuis`
SELECT *
FROM `seminars`
ORDER BY `created_at` DESC
 LIMIT 3

    public function dashboardPengguna()
    {
        // Mendapatkan data seminar dari model
        $userModel = new UserModel();
        $pengguna = $userModel->findAll();

        // Ambil jumlah pengguna untuk ditampilkan di dashboard
        $jumlahPengguna = $this->userModel->countAll();
        $jumlahSeminar = $this->seminarModel->countAll();
        $jumlahMateri = $this->materiModel->countAll();
        $jumlahKuis = $this->kuisModel->countAll();

        // Get only 3 most recent users
        $pengguna = $this->userModel->orderBy('created_at', 'DESC')->findAll(3);
---
SELECT *
FROM `users`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `seminars`
SELECT COUNT(*) AS `numrows` FROM `materi`
SELECT COUNT(*) AS `numrows` FROM `kuis`
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 3

    public function dashboardKuis()
    {
        $questionModel = new QuestionModel();

        $jumlahPengguna = $this->userModel->countAll();
        $jumlahSeminar = $this->seminarModel->countAll();
        $jumlahMateri = $this->materiModel->countAll();
        $jumlahKuis = $this->kuisModel->countAll();

        // Get only 3 most recent quizzes with question count
        $quizzes = $this->kuisModel->orderBy('created_at', 'DESC')->findAll(3);
        foreach ($quizzes as &$quiz) {
            $quiz['jumlah_soal'] = $questionModel->where('kuis_id', $quiz['kuis_id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `seminars`
SELECT COUNT(*) AS `numrows` FROM `materi`
SELECT COUNT(*) AS `numrows` FROM `kuis`
SELECT *
FROM `kuis`
ORDER BY `created_at` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `questions`
WHERE `kuis_id` = '39'

    public function dataPengguna()
    {
        // Cek apakah user sudah login dan memiliki role admin
        if (session()->get('role') != 'admin') {
            return redirect()->to('/auth/login');
        }

        // Ambil semua data pengguna dari database
        $users = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function lihatPengguna($userId)
    {
        // Ambil data pengguna berdasarkan ID
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '1'