app/Controllers/AdminSeminar.php

SELECT *
FROM `seminars`
WHERE `seminars`.`seminar_id` = '2'
---
public function editSeminar($seminar_id)
{
    // Ambil data seminar berdasarkan ID
    $seminarModel = new SeminarModel();
    $seminar = $seminarModel->find($seminar_id);

SELECT *
FROM `seminars`
WHERE `seminars`.`seminar_id` = '8'
DELETE FROM `seminars`
WHERE `seminar_id` IN ('8')
---
public function hapusSeminar($seminar_id)
{
    $referrer = $this->request->getGet('from') ?? 'seminar';
    $seminarModel = new \App\Models\SeminarModel();

    // Cek apakah seminar dengan ID yang diberikan ada
    $seminar = $seminarModel->find($seminar_id);

    if ($seminar) {
        // Hapus seminar dari database
        $seminarModel->delete($seminar_id);