app/Controllers/AdminKuis.php

   public function index()
   {
       $kuisModel = new KuisModel();
       $questionModel = new QuestionModel();

       $quizzes = $kuisModel->findAll();
       foreach ($quizzes as &$quiz) {
           $quiz['jumlah_soal'] = $questionModel->where('kuis_id', $quiz['kuis_id'])->countAllResults();
---
SELECT *
FROM `kuis`
SELECT COUNT(*) AS `numrows`
FROM `questions`
WHERE `kuis_id` = '14'

   public function save()
   {
       $kuisModel = new KuisModel();
       $questionModel = new QuestionModel();

       $judul = $this->request->getPost('judul');
       $kuisId = $this->request->getPost('kuis_id');
       $status = $this->request->getPost('status');
       $pertanyaan = $this->request->getPost('pertanyaan');
       $jawaban_1 = $this->request->getPost('jawaban_1');
       $jawaban_2 = $this->request->getPost('jawaban_2');
       $jawaban_3 = $this->request->getPost('jawaban_3');
       $jawaban_4 = $this->request->getPost('jawaban_4');
       $jawaban_benar = $this->request->getPost('jawaban_benar');

       if (!$judul) {
           return redirect()->back()->with('error', 'Judul kuis harus diisi.')->withInput();
       }

       $dataKuis = [
           'judul' => $judul,
           'status' => $status ?? 'draft',
       ];

       if ($kuisId) {
           $kuisModel->update($kuisId, $dataKuis);
           $message = 'Kuis berhasil diperbarui.';
       } else {
           $kuisId = $kuisModel->insert($dataKuis);
---
INSERT INTO `kuis` (`judul`, `status`) VALUES ('okjhgfcdfghj', 'published')

   public function editKuis($kuisId)
   {
       $referrer = $this->request->getGet('from') ?? 'kuis';
       session()->set('referrer', $referrer);

       $kuisModel = new KuisModel();
       $questionModel = new QuestionModel();

       $kuis = $kuisModel->find($kuisId);
       if (!$kuis) {
        return redirect()->to('/admin/' . $referrer)->with('error', 'Kuis tidak ditemukan');
       }

       $soal = $questionModel->where('kuis_id', $kuisId)->findAll();
---
SELECT *
FROM `kuis`
WHERE `kuis`.`kuis_id` = '23'
SELECT *
FROM `questions`
WHERE `kuis_id` = '23'

   public function delete($kuisId)
   {
    $referrer = $this->request->getGet('from') ?? 'kuis';
       $kuisModel = new KuisModel();
       $questionModel = new QuestionModel();

       $questionModel->where('kuis_id', $kuisId)->delete();

       if ($kuisModel->delete($kuisId)) {
---
DELETE FROM `questions`
WHERE `kuis_id` = '39'
DELETE FROM `kuis`
WHERE `kuis_id` IN ('39')