app/Controllers/Materi.php

    public function detail($materi_id)
    {
        // Ambil data materi berdasarkan ID
        $materi = $this->materiModel->find($materi_id);

        if (!$materi) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Ambil rekomendasi materi lainnya
        $materiLainnya = $this->materiModel
            ->where('materi_id !=', $materi_id) // Hindari materi saat ini
            ->where('status', 'published') // Hanya yang status published
            ->orderBy('created_at', 'DESC') // Urutkan berdasarkan tanggal terbaru
            ->limit(3) // Batasi jumlah materi yang ditampilkan
            ->findAll();
---
SELECT *
FROM `materi`
WHERE `materi`.`materi_id` = '39'
SELECT *
FROM `materi`
WHERE `materi_id` != '39'
AND `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 3