app/Models/KuisModel.php

    public function getPublishedKuis()
{
    return $this->where('status', 'published')
                ->orderBy('judul', 'DESC')
                ->findAll();
---
SELECT *
FROM `kuis`
WHERE `status` = 'published'
ORDER BY `judul` DESC