app/Models/SeminarModel.php

SELECT *
FROM `seminars`
---
    public function getSeminars()
    {
        return $this->findAll(); // Mengambil semua data seminar